zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h543xx.h
/* Bit definition for Ethernet DMA CH Rx Desc Tail Pointer Register */
#define ETH_DMACRDTPR_RDT_Pos                         (0U)
#define ETH_DMACRDTPR_RDT_Msk                         (0xFFFFFFFFUL << ETH_DMACRDTPR_RDT_Pos) /*!< 0xFFFFFFFF */
#define ETH_DMACRDTPR_RDT                             ETH_DMACRDTPR_RDT_Msk   /* Receive Descriptor Tail Pointer */

/* Bit definition for Ethernet DMA CH Tx Desc Ring Length Register */
#define ETH_DMACTDRLR_TDRL_Pos                        (0U)
#define ETH_DMACTDRLR_TDRL_Msk                        (0x3FFUL << ETH_DMACTDRLR_TDRL_Pos) /*!< 0x000003FF */
#define ETH_DMACTDRLR_TDRL                            ETH_DMACTDRLR_TDRL_Msk   /* Transmit Descriptor Ring Length */

/* Bit definition for Ethernet DMA CH Rx Desc Ring Length Register */
#define ETH_DMACRDRLR_ARBS_Pos                        (16U)
#define ETH_DMACRDRLR_ARBS_Msk                        (0xFFUL << ETH_DMACRDRLR_ARBS_Pos) /*!< 0x000FE0000 */
#define ETH_DMACRDRLR_ARBS                            ETH_DMACRDRLR_ARBS_Msk   /* Alternate Receive Buffer Size */
#define ETH_DMACRDRLR_RDRL_Pos                        (0U)
#define ETH_DMACRDRLR_RDRL_Msk                        (0x3FFUL << ETH_DMACRDRLR_RDRL_Pos) /*!< 0x000003FF */
#define ETH_DMACRDRLR_RDRL                            ETH_DMACRDRLR_RDRL_Msk   /* Receive Descriptor Ring Length */

/* Bit definition for Ethernet DMA Channel Interrupt Enable Register */
#define ETH_DMACIER_NIE_Pos                           (15U)
#define ETH_DMACIER_NIE_Msk                           (0x1UL << ETH_DMACIER_NIE_Pos) /*!< 0x00008000 */
#define ETH_DMACIER_NIE                               ETH_DMACIER_NIE_Msk      /* Normal Interrupt Summary Enable */
#define ETH_DMACIER_AIE_Pos                           (14U)
#define ETH_DMACIER_AIE_Msk                           (0x1UL << ETH_DMACIER_AIE_Pos) /*!< 0x00004000 */
#define ETH_DMACIER_AIE                               ETH_DMACIER_AIE_Msk      /* Abnormal Interrupt Summary Enable */
#define ETH_DMACIER_CDEE_Pos                          (13U)
#define ETH_DMACIER_CDEE_Msk                          (0x1UL << ETH_DMACIER_CDEE_Pos) /*!< 0x00002000 */
#define ETH_DMACIER_CDEE                              ETH_DMACIER_CDEE_Msk     /* Context Descriptor Error Enable */
#define ETH_DMACIER_FBEE_Pos                          (12U)
#define ETH_DMACIER_FBEE_Msk                          (0x1UL << ETH_DMACIER_FBEE_Pos) /*!< 0x00001000 */
#define ETH_DMACIER_FBEE                              ETH_DMACIER_FBEE_Msk     /* Fatal Bus Error Enable */
#define ETH_DMACIER_ERIE_Pos                          (11U)
#define ETH_DMACIER_ERIE_Msk                          (0x1UL << ETH_DMACIER_ERIE_Pos) /*!< 0x00000800 */
#define ETH_DMACIER_ERIE                              ETH_DMACIER_ERIE_Msk     /* Early Receive Interrupt Enable */
#define ETH_DMACIER_ETIE_Pos                          (10U)
#define ETH_DMACIER_ETIE_Msk                          (0x1UL << ETH_DMACIER_ETIE_Pos) /*!< 0x00000400 */
#define ETH_DMACIER_ETIE                              ETH_DMACIER_ETIE_Msk     /* Early Transmit Interrupt Enable */
#define ETH_DMACIER_RWTE_Pos                          (9U)
#define ETH_DMACIER_RWTE_Msk                          (0x1UL << ETH_DMACIER_RWTE_Pos) /*!< 0x00000200 */
#define ETH_DMACIER_RWTE                              ETH_DMACIER_RWTE_Msk     /* Receive Watchdog Timeout Enable */
#define ETH_DMACIER_RSE_Pos                           (8U)
#define ETH_DMACIER_RSE_Msk                           (0x1UL << ETH_DMACIER_RSE_Pos) /*!< 0x00000100 */
#define ETH_DMACIER_RSE                               ETH_DMACIER_RSE_Msk      /* Receive Stopped Enable */
#define ETH_DMACIER_RBUE_Pos                          (7U)
#define ETH_DMACIER_RBUE_Msk                          (0x1UL << ETH_DMACIER_RBUE_Pos) /*!< 0x00000080 */
#define ETH_DMACIER_RBUE                              ETH_DMACIER_RBUE_Msk     /* Receive Buffer Unavailable Enable */
#define ETH_DMACIER_RIE_Pos                           (6U)
#define ETH_DMACIER_RIE_Msk                           (0x1UL << ETH_DMACIER_RIE_Pos) /*!< 0x00000040 */
#define ETH_DMACIER_RIE                               ETH_DMACIER_RIE_Msk      /* Receive Interrupt Enable */
#define ETH_DMACIER_TBUE_Pos                          (2U)
#define ETH_DMACIER_TBUE_Msk                          (0x1UL << ETH_DMACIER_TBUE_Pos) /*!< 0x00000004 */
#define ETH_DMACIER_TBUE                              ETH_DMACIER_TBUE_Msk     /* Transmit Buffer Unavailable Enable */
#define ETH_DMACIER_TXSE_Pos                          (1U)
#define ETH_DMACIER_TXSE_Msk                          (0x1UL << ETH_DMACIER_TXSE_Pos) /*!< 0x00000002 */
#define ETH_DMACIER_TXSE                              ETH_DMACIER_TXSE_Msk     /* Transmit Stopped Enable */
#define ETH_DMACIER_TIE_Pos                           (0U)
#define ETH_DMACIER_TIE_Msk                           (0x1UL << ETH_DMACIER_TIE_Pos) /*!< 0x00000001 */
#define ETH_DMACIER_TIE                               ETH_DMACIER_TIE_Msk      /* Transmit Interrupt Enable */

/* Bit definition for Ethernet DMA Channel Rx Interrupt Watchdog Timer Register */
#define ETH_DMACRIWTR_PSEL_Pos                        (31U)
#define ETH_DMACRIWTR_PSEL_Msk                        (0x1UL << ETH_DMACRIWTR_PSEL_Pos) /*!< 0x80000000 */
#define ETH_DMACRIWTR_PSEL                            ETH_DMACRIWTR_PSEL_Msk    /* Packet Count Interrupt Select */
#define ETH_DMACRIWTR_RBCT_Pos                        (20U)
#define ETH_DMACRIWTR_RBCT_Msk                        (0x3FFUL << ETH_DMACRIWTR_RBCT_Pos) /*!< 0x3FF00000 */
#define ETH_DMACRIWTR_RBCT                            ETH_DMACRIWTR_RBCT_Msk    /* Receive Byte Count Threshold */
#define ETH_DMACRIWTR_ITCU_Pos                        (18U)
#define ETH_DMACRIWTR_ITCU_Msk                        (0x3UL << ETH_DMACRIWTR_ITCU_Pos) /*!< 0x000C0000 */
#define ETH_DMACRIWTR_ITCU                            ETH_DMACRIWTR_ITCU_Msk    /* Rx Idle Timer Count Units */
#define ETH_DMACRIWTR_ITCU_256                        ((uint32_t)0x00000000)   /* 256 */
#define ETH_DMACRIWTR_ITCU_512_Pos                    (18U)
#define ETH_DMACRIWTR_ITCU_512_Msk                    (0x1UL << ETH_DMACRIWTR_ITCU_512_Pos) /*!< 0x00040000 */
#define ETH_DMACRIWTR_ITCU_512                        ETH_DMACRIWTR_ITCU_512_Msk    /* 512 */
#define ETH_DMACRIWTR_ITCU_1024_Pos                   (19U)
#define ETH_DMACRIWTR_ITCU_1024_Msk                   (0x1UL << ETH_DMACRIWTR_ITCU_1024_Pos) /*!< 0x00080000 */
#define ETH_DMACRIWTR_ITCU_1024                       ETH_DMACRIWTR_ITCU_1024_Msk    /* 1024 */
#define ETH_DMACRIWTR_ITCU_2048_Pos                   (18U)
#define ETH_DMACRIWTR_ITCU_2048_Msk                   (0x3UL << ETH_DMACRIWTR_ITCU_2048_Pos) /*!< 0x000C0000 */
#define ETH_DMACRIWTR_ITCU_2048                       ETH_DMACRIWTR_ITCU_2048_Msk    /* 2048 */
#define ETH_DMACRIWTR_RWTU_Pos                        (16U)
#define ETH_DMACRIWTR_RWTU_Msk                        (0x3UL << ETH_DMACRIWTR_RWTU_Pos) /*!< 0x00030000 */
#define ETH_DMACRIWTR_RWTU                            ETH_DMACRIWTR_RWTU_Msk    /* Receive Interrupt Watchdog Timer Count Units */
#define ETH_DMACRIWTR_RWTU_256                        ((uint32_t)0x00000000)   /* 256 */
#define ETH_DMACRIWTR_RWTU_512_Pos                    (16U)
#define ETH_DMACRIWTR_RWTU_512_Msk                    (0x1UL << ETH_DMACRIWTR_RWTU_512_Pos) /*!< 0x00010000 */
#define ETH_DMACRIWTR_RWTU_512                        ETH_DMACRIWTR_RWTU_512_Msk    /* 512 */
#define ETH_DMACRIWTR_RWTU_1024_Pos                   (17U)
#define ETH_DMACRIWTR_RWTU_1024_Msk                   (0x1UL << ETH_DMACRIWTR_RWTU_1024_Pos) /*!< 0x00020000 */
#define ETH_DMACRIWTR_RWTU_1024                       ETH_DMACRIWTR_RWTU_1024_Msk    /* 1024 */
#define ETH_DMACRIWTR_RWTU_2048_Pos                   (16U)
#define ETH_DMACRIWTR_RWTU_2048_Msk                   (0x3UL << ETH_DMACRIWTR_RWTU_2048_Pos) /*!< 0x00030000 */
#define ETH_DMACRIWTR_RWTU_2048                       ETH_DMACRIWTR_RWTU_2048_Msk    /* 2048 */
#define ETH_DMACRIWTR_ITW_Pos                         (8U)
#define ETH_DMACRIWTR_ITW_Msk                         (0x1FUL << ETH_DMACRIWTR_ITW_Pos) /*!< 0x00001F00 */
#define ETH_DMACRIWTR_ITW                             ETH_DMACRIWTR_ITW_Msk    /* Rx Idle Timer Window */
#define ETH_DMACRIWTR_RWT_Pos                         (0U)
#define ETH_DMACRIWTR_RWT_Msk                         (0xFFUL << ETH_DMACRIWTR_RWT_Pos) /*!< 0x000000FF */
#define ETH_DMACRIWTR_RWT                             ETH_DMACRIWTR_RWT_Msk    /* Receive Interrupt Watchdog Timer Count */

